src/Catalogs/ро_Оборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ро_Оборудование</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Дефектовка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Детали</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДеталиОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ро_Оборудование/Ext/ManagerModule.bsl
Функция ПолучитьДеталиДефектовки(сс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ро_ОборудованиеДефектовка.Детали КАК Деталь,
	               |	ро_ОборудованиеДефектовка.Количество КАК Количество,
				   |    Значение(Справочник.Дефекты.Годен) Дефект,
				   |    Истина Годен
	               |ИЗ
	               |	Справочник.ро_Оборудование.Дефектовка КАК ро_ОборудованиеДефектовка
	               |ГДЕ
	               |	ро_ОборудованиеДефектовка.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("ссылка",сс);
	
	Тбл = Запрос.Выполнить().Выгрузить();
	
	Мас = новый Массив;
	Для каждого Стр из Тбл Цикл
		Стк = Новый Структура;
		Для каждого Кол из Тбл.Колонки Цикл
			Стк.Вставить(Кол.имя,Стр[Кол.имя]);
		КонецЦикла;
		Мас.добавить(Стк);
	КонецЦикла;
	
	Возврат Мас;
	
КонецФункции
